Tutorial/OF8/secondaryTwoPhase/constant/momentumTransport.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;//laminar;//

RAS
{
    model    mixtureKEpsilon; //kOmegaSSTSato;//continuousGasKEpsilon;//kEpsilon;// kOmegaSST;//

    turbulence      on;
    printCoeffs     on;
}

// ************************************************************************* //
