Tutorial/OF8/secondaryTwoPhase/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

F		F [0 0 1 0 -1 1 0] 96485; //Cb/mol 

kf		dimensions [-1 -3 3 0 0 2 0] 38;// // S/m == A/V/m == A^2s^3/kg/m^3 

nu_e	2;

nu_OH	2;



ba	4.85e-2;// V

j0a	9.38e-2;//  A/m2

E0a	1.208;// V


bc	-6.08e-2;//  V

j0c	-6.95e-1;//  A/m2

E0c	0;//  V

//-----------------------------------------------------------------------------//

ba	0.05; //  V == used when control == 3 for cathodic main reaction


// ************************************************************************* //
