Tutorial/OF8/secondaryTwoPhase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr      1;//1
        nAlphaSubCycles 1;//3;
        //implicitPhasePressure yes;

        //extremaCoeff    1;

        solver          PBiCGStab;
        preconditioner  DIC;

        tolerance       1e-9;
        relTol          0;
        minIter         1;
    }

    bubbles
    {
        nCorr                1;
        tolerance            1e-4;
        scale                true;
        sourceUpdateInterval 1;
        solveOnFinalIterOnly true;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-8;
        relTol          0;//0.01;
        //maxIter         20;
        minIter         2;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "U.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
        minIter         1;
    }

    "e.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        minIter         0://1;
        maxIter	 0;
    }
    
    fi
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0;//0.5;
    }
    fiFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0;//0.5;
    }
    
    "(k|epsilon|omega|Theta).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
        minIter         1;
    }

    "f.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }
    
}

PIMPLE
{
    nOuterCorrectors 1;//3;
    nCorrectors      1;
    nNonOrthogonalCorrectors 0;
    //nEnergyCorrectors   1;
    //faceMomentum        yes;
}

relaxationFactors
{
    equations
    {
        ".*"            1;//1;
    }
}


// ************************************************************************* //
